; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v10)
             (pred_11 ?v7 ?v3)
             (pred_9 ?v2 ?v3)
             (pred_6 ?v1 ?v2 )
	     (pred_4 ?v2)
             (pred_12 ?v9)
             (pred_3 ?v7)
             (pred_1 ?v3)
             (pred_7 ?v2)
             (pred_5 ?v7)
             (pred_8 ?v2)
             (pred_2 ))



(:action op_1
:parameters (?v13 ?v6 ?v4 ?v8)
:precondition (and (pred_12 ?v13) (pred_12 ?v6) (pred_3 ?v4) (pred_1 ?v8)
          (pred_10 ?v13 ?v6) (pred_11 ?v4 ?v8)
                   (pred_9 ?v6 ?v8) (pred_4 ?v13) 
                   (pred_7 ?v6) (pred_5 ?v4))
:effect (and  (pred_8 ?v6) (not (pred_7 ?v6))))


(:action op_3
:parameters (?v13 ?v11)
:precondition (and (pred_12 ?v13) (pred_12 ?v11)
               (pred_4 ?v13) (pred_10 ?v13 ?v11) (pred_8 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v13))))

(:action op_5
:parameters (?v13 ?v4)
:precondition (and (pred_12 ?v13) (pred_3 ?v4) 
                  (pred_4 ?v13) (pred_6 ?v4 ?v13) (pred_2 ))
:effect (and (pred_5 ?v4)
   (not (pred_6 ?v4 ?v13)) (not (pred_2 ))))


(:action op_2
:parameters (?v13 ?v12 ?v5)
:precondition (and (pred_12 ?v13) (pred_3 ?v12) (pred_3 ?v5)
                  (pred_4 ?v13) (pred_5 ?v5) (pred_6 ?v12 ?v13))
:effect (and (pred_5 ?v12) (pred_6 ?v5 ?v13)
        (not (pred_5 ?v5)) (not (pred_6 ?v12 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_12 ?v13) (pred_3 ?v4) 
                  (pred_4 ?v13) (pred_5 ?v4))
:effect (and (pred_2 ) (pred_6 ?v4 ?v13) (not (pred_5 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_14 obj_15 obj_02 obj_04 obj_08 obj_09 obj_20 obj_06 obj_13 obj_18 obj_17 obj_05 obj_19 obj_11 obj_10
    obj_12 obj_16
    obj_03 obj_01
    )

    (:init
       (pred_2)

       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_02)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_3 obj_03)
       (pred_3 obj_01)

       (pred_10 obj_07 obj_04)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_15)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_15 obj_14)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_10 obj_11)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_9  obj_18 obj_12)
       (pred_9  obj_02 obj_16)
       (pred_8 obj_07)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_8 obj_20)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_17)
       (pred_8 obj_05)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_10)

       (pred_11  obj_03 obj_12)
       (pred_11  obj_01 obj_16)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_01 obj_19)
       (pred_4 obj_19)
    )

    (:goal (and
       (pred_6 obj_01 obj_20)
    ))
(:constraints
  (always (not (pred_4 obj_13)))
)
)

; plan
1. (op_5 obj_19 obj_01)
   deleted: (pred_6 obj_01 obj_19) (pred_2)
   added: (pred_5 obj_01)
   goals met: 0 of 1
2. (op_3 obj_19 obj_11)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_11)
   goals met: 0 of 1
3. (op_3 obj_11 obj_10)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_10)
   goals met: 0 of 1
4. (op_3 obj_10 obj_17)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_20)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_20)
   goals met: 0 of 1
6. (op_4 obj_20 obj_01)
   deleted: (pred_5 obj_01)
   added: (pred_2) (pred_6 obj_01 obj_20)
   goals met: 1 of 1
